Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.GetModelVersionsAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo,System.Threading.CancellationToken)
Asynchronously retrieves all versions of a given BIM model from the Bim Model Data Product service.
accessToken: The Trimble access token used for authentication.
cloudModelInfo: The cloud model information from which to retrieve versions. Must be of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.
cancellationToken: Optional.
Returns:
An array of Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo instances, each representing a version of the specified model.
Throws System.NotSupportedException:
Thrown if the provided cloudModelInfo is not of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.
Throws System.ArgumentException: Provided arguments are not valid
Exception occurred when fetching the model version.